Repository: Rsof-For-information-Technologies/Rsof-Sadef
Catalog: Backend/Sadef.Application/Resources/Messages.*.resx
Languages: ar

# Success_OperationCompleted
source: Operation completed successfully.
ar: تم إكمال العملية بنجاح.

# Error_Unexpected
source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

# Notification_Welcome
source: Welcome to Sadef!
ar: مرحباً بك في صدف!

# Property_Created
source: Property created successfully.
ar: تم إنشاء العقار بنجاح.

# Property_Listed
source: Properties retrieved successfully.
ar: تم استرجاع العقارات بنجاح.

source: Property not found.
ar: العقار غير موجود.

# Property_Found
source: Property found successfully.
ar: تم العثور على العقار بنجاح.

# Property_Deleted
source: Property deleted successfully.
ar: تم حذف العقار بنجاح.

# Property_Updated
source: Property updated successfully.
ar: تم تحديث العقار بنجاح.

# Property_StatusUpdated
source: Status updated successfully from {0} to {1}.
ar: تم تحديث الحالة بنجاح من {0} إلى {1}.

# Property_Filtered
source: Fetched with filters.
ar: تم الجلب مع الفلاتر.

# Property_ExpirySet
source: Expiry set to {0}.
ar: تم تعيين تاريخ الانتهاء إلى {0}.

# Property_DashboardLoaded
source: Dashboard stats loaded.
ar: تم تحميل إحصائيات لوحة التحكم.

# Property_ListedFromCache
source: Properties retrieved successfully (from cache).
ar: تم استرجاع العقارات بنجاح (من التخزين المؤقت).

# Property_InvalidStatusTransition
source: Invalid status transition from {0} to {1}.
ar: انتقال حالة غير صالح من {0} إلى {1}.

# Property_FilteredFromCache
source: Fetched from cache.
ar: تم الجلب من التخزين المؤقت.

# Property_DashboardLoadedFromCache
source: Dashboard stats loaded (from cache).
ar: تم تحميل إحصائيات لوحة التحكم (من التخزين المؤقت).

# Property_AtLeastOneTranslationRequired
source: At least one translation is required.
ar: مطلوب ترجمة واحدة على الأقل.

# Property_TitleRequiredForLanguage
source: Title is required for language '{0}'.
ar: العنوان مطلوب للغة '{0}'.

# Property_DescriptionRequiredForLanguage
source: Description is required for language '{0}'.
ar: الوصف مطلوب للغة '{0}'.

# Property_InvalidLanguageCode
source: Invalid language code '{0}'. Only 'en' and 'ar' are supported.
ar: رمز لغة غير صالح '{0}'. يدعم فقط 'en' و 'ar'.

# Lead_Created
source: Inquiry submitted successfully.
ar: تم إرسال الاستفسار بنجاح.

# Lead_InvalidPropertyReference
source: Invalid property reference. The specified property does not exist.
ar: مرجع عقار غير صالح. العقار المحدد غير موجود.

# Lead_Listed
source: Leads retrieved successfully.
ar: تم استرجاع الاستفسارات بنجاح.

source: Lead not found.
ar: الاستفسار غير موجود.

# Lead_Updated
source: Lead updated successfully.
ar: تم تحديث الاستفسار بنجاح.

# Lead_DashboardLoaded
source: Lead dashboard stats loaded.
ar: تم تحميل إحصائيات لوحة تحكم الاستفسارات.

# Lead_StatusRequired
source: Status cannot be null.
ar: الحالة لا يمكن أن تكون فارغة.

# Lead_InvalidStatusTransition
source: Invalid status transition from {0} to {1}.
ar: انتقال حالة غير صالح من {0} إلى {1}.

# Blog_Created
source: Blog created successfully.
ar: تم إنشاء المدونة بنجاح.

# Blog_Listed
source: Blogs retrieved successfully.
ar: تم استرجاع المدونات بنجاح.

source: Blog not found.
ar: المدونة غير موجودة.

# Blog_Found
source: Blog found successfully.
ar: تم العثور على المدونة بنجاح.

# Blog_Updated
source: Blog updated successfully.
ar: تم تحديث المدونة بنجاح.

# Blog_Deleted
source: Blog deleted successfully.
ar: تم حذف المدونة بنجاح.

# Blog_ListedFromCache
source: Blogs retrieved successfully (from cache).
ar: تم استرجاع المدونات بنجاح (من التخزين المؤقت).

# Blog_AtLeastOneTranslationRequired
source: At least one translation is required.
ar: مطلوب ترجمة واحدة على الأقل.

# Blog_TitleRequiredForLanguage
source: Title is required for language '{0}'.
ar: العنوان مطلوب للغة '{0}'.

# Blog_ContentRequiredForLanguage
source: Content is required for language '{0}'.
ar: المحتوى مطلوب للغة '{0}'.

# Blog_InvalidLanguageCode
source: Invalid language code '{0}'. Only 'en' and 'ar' are supported.
ar: رمز لغة غير صالح '{0}'. يدعم فقط 'en' و 'ar'.

# Contact_Created
source: Contact created successfully.
ar: تم إنشاء الاتصال بنجاح.

# Contact_Listed
source: Contacts retrieved successfully.
ar: تم استرجاع الاتصالات بنجاح.

source: Contact not found.
ar: الاتصال غير موجود.

# Contact_Found
source: Contact found successfully.
ar: تم العثور على الاتصال بنجاح.

# Contact_Updated
source: Contact updated successfully.
ar: تم تحديث الاتصال بنجاح.

# Contact_Deleted
source: Contact deleted successfully.
ar: تم حذف الاتصال بنجاح.

# Contact_StatusUpdated
source: Contact status updated successfully.
ar: تم تحديث حالة الاتصال بنجاح.

# Contact_ListedFromCache
source: Contacts retrieved successfully (from cache).
ar: تم استرجاع الاتصالات بنجاح (من التخزين المؤقت).

# Contact_AtLeastOneTranslationRequired
source: At least one translation is required.
ar: مطلوب ترجمة واحدة على الأقل.

# Contact_SubjectRequiredForLanguage
source: Subject is required for language '{0}'.
ar: الموضوع مطلوب للغة '{0}'.

# Contact_MessageRequiredForLanguage
source: Message is required for language '{0}'.
ar: الرسالة مطلوبة للغة '{0}'.

# Contact_InvalidLanguageCode
source: Invalid language code '{0}'. Only 'en' and 'ar' are supported.
ar: رمز لغة غير صالح '{0}'. يدعم فقط 'en' و 'ar'.

# Contact_InvalidPropertyReference
source: Invalid property reference for contact.
ar: مرجع عقار غير صالح. العقار المحدد غير موجود.

# Contact_SubjectRequired
source: Subject is required.
ar: الموضوع مطلوب.

# Contact_SubjectMaxLength
source: Subject cannot exceed {0} characters.
ar: الموضوع لا يمكن أن يتجاوز {0} حرف.

# Contact_MessageRequired
source: Message is required.
ar: الرسالة مطلوبة.

# Contact_MessageMinLength
source: Message must be at least {0} characters long.
ar: الرسالة يجب أن تكون {0} حرف على الأقل.

# Contact_MessageMaxLength
source: Message cannot exceed {0} characters.
ar: الرسالة لا يمكن أن تتجاوز {0} حرف.

# Contact_PreferredContactMethodMaxLength
source: Preferred contact method cannot exceed {0} characters.
ar: طريقة الاتصال المفضلة لا يمكن أن تتجاوز {0} حرف.

# Contact_LocationMaxLength
source: Location cannot exceed {0} characters.
ar: الموقع لا يمكن أن يتجاوز {0} حرف.

# Contact_LanguageCodeRequired
source: Language code is required.
ar: رمز اللغة مطلوب.

# User_Created
source: User created successfully.
ar: تم إنشاء المستخدم بنجاح.

# User_Listed
source: Users retrieved successfully.
ar: تم استرجاع المستخدمين بنجاح.

source: User not found.
ar: المستخدم غير موجود.

# User_Found
source: User found successfully.
ar: تم العثور على المستخدم بنجاح.

# User_Deleted
source: User deleted successfully.
ar: تم حذف المستخدم بنجاح.

# User_LoginSuccessful
source: Login successful.
ar: تم تسجيل الدخول بنجاح.

# User_LoginFailed
source: Login failed. Please check your credentials.
ar: فشل تسجيل الدخول. يرجى التحقق من بيانات الاعتماد الخاصة بك.

# User_LogoutSuccessful
source: Logout successful.
ar: تم تسجيل الخروج بنجاح.

# User_RegistrationSuccessful
source: Registration successful.
ar: تم التسجيل بنجاح.

# User_RegistrationFailed
source: Registration failed.
ar: فشل التسجيل.

# User_PasswordResetEmailSent
source: Password reset email sent successfully.
ar: تم إرسال بريد إعادة تعيين كلمة المرور بنجاح.

# User_PasswordResetEmailFailed
source: Failed to send password reset email: {0}
ar: فشل في إرسال بريد إعادة تعيين كلمة المرور: {0}

# User_PasswordResetButEmailFailed
source: Password reset was successful, but confirmation email failed to send.
ar: تم إعادة تعيين كلمة المرور بنجاح، لكن فشل في إرسال بريد التأكيد.

# User_PasswordResetAndEmailSent
source: Password reset successfully. A confirmation email has been sent.
ar: تم إعادة تعيين كلمة المرور بنجاح. تم إرسال بريد تأكيد.

# User_NoUsersFound
source: No users found.
ar: لم يتم العثور على مستخدمين.

# User_EmailAlreadyInUse
source: Email is already in use by another user.
ar: البريد الإلكتروني مستخدم بالفعل من قبل مستخدم آخر.

# User_FailedToUpdate
source: Failed to update user.
ar: فشل في تحديث المستخدم.

# User_RoleDoesNotExist
source: Role '{0}' does not exist.
ar: الدور '{0}' غير موجود.

# User_FailedToUpdateRole
source: Failed to update role.
ar: فشل في تحديث الدور.

# User_Updated
source: User updated successfully.
ar: تم تحديث المستخدم بنجاح.

# User_UnauthorizedAccess
source: Unauthorized access.
ar: وصول غير مصرح.

# User_NotAuthorizedToUpdatePassword
source: You are not authorized to update this user's password.
ar: أنت غير مصرح لك بتحديث كلمة مرور هذا المستخدم.

# User_OldPasswordIncorrect
source: Old password is incorrect.
ar: كلمة المرور القديمة غير صحيحة.

# User_FailedToChangePassword
source: Failed to change password: {0}
ar: فشل في تغيير كلمة المرور: {0}

# User_PasswordChanged
source: Password changed successfully.
ar: تم تغيير كلمة المرور بنجاح.

# User_InvalidEmail
source: Invalid email.
ar: بريد إلكتروني غير صالح.

# User_InvalidRefreshToken
source: Invalid refresh token.
ar: رمز التحديث غير صالح.

# User_RefreshTokenExpired
source: Refresh token expired, please log in again.
ar: انتهت صلاحية رمز التحديث، يرجى تسجيل الدخول مرة أخرى.

# User_TokenRefreshed
source: Token refreshed successfully.
ar: تم تحديث الرمز بنجاح.

# Identity_PasswordRequiresNonAlphanumeric
source: Passwords must have at least one non alphanumeric character.
ar: يجب أن تحتوي كلمات المرور على حرف واحد غير أبجدي رقمي على الأقل.

# Identity_PasswordRequiresDigit
source: Passwords must have at least one digit ('0'-'9').
ar: يجب أن تحتوي كلمات المرور على رقم واحد على الأقل ('0'-'9').

# Identity_PasswordRequiresLower
source: Passwords must have at least one lowercase ('a'-'z').
ar: يجب أن تحتوي كلمات المرور على حرف صغير واحد على الأقل ('a'-'z').

# Identity_PasswordRequiresUpper
source: Passwords must have at least one uppercase ('A'-'Z').
ar: يجب أن تحتوي كلمات المرور على حرف كبير واحد على الأقل ('A'-'Z').

# Identity_PasswordTooShort
source: Passwords must be at least '{0}' characters.
ar: يجب أن تكون كلمات المرور '{0}' أحرف على الأقل.

# Identity_DuplicateUserName
source: User name '{0}' is already taken.
ar: اسم المستخدم '{0}' مستخدم بالفعل.

# Identity_DuplicateEmail
source: Email '{0}' is already taken.
ar: البريد الإلكتروني '{0}' مستخدم بالفعل.

# Identity_InvalidUserName
source: User name '{0}' is invalid, can only contain letters or digits.
ar: اسم المستخدم '{0}' غير صالح، يمكن أن يحتوي فقط على أحرف أو أرقام.

# Identity_InvalidEmail
source: Email '{0}' is invalid.
ar: البريد الإلكتروني '{0}' غير صالح.

# Identity_UnknownError
source: An error occurred while creating the user.
ar: حدث خطأ أثناء إنشاء المستخدم.

# Favorite_AlreadyExists
source: Property already favorited.
ar: العقار مفضل بالفعل.

# Favorite_Added
source: Property added to favorites.
ar: تم إضافة العقار إلى المفضلة.

source: Favorite not found.
ar: المفضلة غير موجودة.

# Favorite_Removed
source: Property removed from favorites.
ar: تم إزالة العقار من المفضلة.

# Favorite_Loaded
source: Favorites loaded.
ar: تم تحميل المفضلة.
