Repository: Rsof-For-information-Technologies/Rsof-Sadef
Catalog: Backend/Sadef.Application/Resources/Validation.*.resx
Languages: ar

# Required
source: The {0} field is required.
ar: حقل {0} مطلوب.

# Email_Invalid
source: Please enter a valid email address.
ar: يرجى إدخال بريد إلكتروني صالح.

# Title_MaxLength
source: Title cannot exceed {0} characters.
ar: يجب ألا يتجاوز العنوان {0} حرفًا.

# Content_MinLength
source: Content must be at least {0} characters.
ar: يجب أن يكون المحتوى على الأقل {0} حرفًا.

source: Invalid blog ID.
ar: معرف المدونة غير صالح.

# Property_TitleRequired
source: Property title is required.
ar: عنوان العقار مطلوب.

# Property_TitleMaxLength
source: Title cannot exceed {0} characters.
ar: يجب ألا يتجاوز العنوان {0} حرفًا.

# Property_DescriptionRequired
source: Property description is required.
ar: وصف العقار مطلوب.

# Property_DescriptionMaxLength
source: Description cannot exceed {0} characters.
ar: يجب ألا يتجاوز الوصف {0} حرفًا.

# Property_PriceGreaterThanZero
source: Price must be greater than zero.
ar: يجب أن يكون السعر أكبر من الصفر.

# Property_CityRequired
source: City is required.
ar: المدينة مطلوبة.

# Property_LocationRequired
source: Location is required.
ar: الموقع مطلوب.

# Property_AreaSizeGreaterThanZero
source: Area size must be greater than zero.
ar: يجب أن تكون المساحة أكبر من الصفر.

# Property_BedroomsZeroOrMore
source: Bedrooms must be zero or more.
ar: يجب أن يكون عدد غرف النوم صفر أو أكثر.

# Property_BathroomsZeroOrMore
source: Bathrooms must be zero or more.
ar: يجب أن يكون عدد الحمامات صفر أو أكثر.

# Property_MaxVideos
source: You can upload up to {0} videos only.
ar: يمكنك رفع حتى {0} فيديو فقط.

# Property_VideoMaxSizeMB
source: Each video must be {0}MB or smaller.
ar: يجب ألا يزيد حجم كل فيديو عن {0} ميجابايت.

# Property_InvalidId
source: Invalid property ID.
ar: معرف العقار غير صالح.

# Property_MetaTitleMaxLength
source: Meta title cannot exceed {0} characters.
ar: لا يمكن أن يتجاوز عنوان الميتا {0} حرفًا.

# Property_MetaDescriptionMaxLength
source: Meta description cannot exceed {0} characters.
ar: لا يمكن أن يتجاوز وصف الميتا {0} حرفًا.

# Property_MetaKeywordsMaxLength
source: Meta keywords cannot exceed {0} characters.
ar: لا يمكن أن تتجاوز كلمات الميتا الرئيسية {0} حرفًا.

# Property_CanonicalUrlMaxLength
source: Canonical URL cannot exceed {0} characters.
ar: لا يمكن أن يتجاوز الرابط القانوني {0} حرفًا.

# Property_CanonicalUrlInvalid
source: Canonical URL format is invalid.
ar: تنسيق الرابط القانوني غير صالح.

# Property_SlugMaxLength
source: Slug must not exceed {0} characters.
ar: لا يمكن أن يتجاوز السلاق {0} حرفًا.

# Property_SlugInvalid
source: Slug must be URL-friendly (lowercase letters, numbers, and dashes only).
ar: يجب أن يكون السلاق مناسبًا للرابط (أحرف صغيرة، أرقام، وشرطات فقط).

# Property_ExpiryDateFuture
source: Expiry date must be in the future.
ar: يجب أن يكون تاريخ الانتهاء في المستقبل.

# Lead_FullNameRequired
source: Full name is required.
ar: الاسم الكامل مطلوب.

# Lead_FullNameMaxLength
source: Full name cannot exceed {0} characters.
ar: يجب ألا يتجاوز الاسم الكامل {0} حرفًا.

# Lead_EmailRequired
source: Email is required.
ar: البريد الإلكتروني مطلوب.

# Lead_EmailInvalid
source: Invalid email format.
ar: تنسيق البريد الإلكتروني غير صالح.

# Lead_PhoneMaxLength
source: Phone number cannot exceed {0} characters.
ar: يجب ألا يتجاوز رقم الهاتف {0} حرفًا.

# Lead_MessageMaxLength
source: Message cannot exceed {0} characters.
ar: يجب ألا تتجاوز الرسالة {0} حرفًا.

# Lead_StatusInvalid
source: Invalid lead status value.
ar: قيمة حالة العميل المحتمل غير صالحة.

# User_FirstNameRequired
source: First name is required.
ar: الاسم الأول مطلوب.

# User_FirstNameLetters
source: First name must contain only letters and spaces.
ar: يجب أن يحتوي الاسم الأول على أحرف ومسافات فقط.

# User_FirstNameMaxLength
source: First name cannot exceed {0} characters.
ar: يجب ألا يتجاوز الاسم الأول {0} حرفًا.

# User_LastNameRequired
source: Last name is required.
ar: اسم العائلة مطلوب.

# User_LastNameLetters
source: Last name must contain only letters and spaces.
ar: يجب أن يحتوي اسم العائلة على أحرف ومسافات فقط.

# User_LastNameMaxLength
source: Last name cannot exceed {0} characters.
ar: يجب ألا يتجاوز اسم العائلة {0} حرفًا.

# User_EmailRequired
source: Email is required.
ar: البريد الإلكتروني مطلوب.

# User_EmailInvalid
source: Invalid email address format.
ar: تنسيق البريد الإلكتروني غير صالح.

# User_PasswordRequired
source: Password is required.
ar: كلمة المرور مطلوبة.

# User_PasswordMinLength
source: Password must be at least {0} characters long.
ar: يجب أن تتكون كلمة المرور من {0} أحرف على الأقل.

# User_ConfirmPasswordMatch
source: Passwords do not match.
ar: كلمتا المرور غير متطابقتين.

# User_RoleRequired
source: Role is required.
ar: الدور مطلوب.

# User_RoleInvalid
source: Please enter a valid role
ar: يرجى إدخال دور صالح.

# User_TokenRequired
source: Token is required.
ar: الرمز مطلوب.

# User_UserIdRequired
source: User ID is required.
ar: معرف المستخدم مطلوب.

# User_OldPasswordRequired
source: Old password is required.
ar: كلمة المرور القديمة مطلوبة.

# User_NewPasswordRequired
source: New password is required.
ar: كلمة المرور الجديدة مطلوبة.

# User_NewPasswordMinLength
source: New password must be at least {0} characters long.
ar: يجب أن تتكون كلمة المرور الجديدة من {0} أحرف على الأقل.

# User_ConfirmNewPasswordRequired
source: Confirm new password is required.
ar: تأكيد كلمة المرور الجديدة مطلوب.

# User_ConfirmNewPasswordMatch
source: Confirm new password must match the new password.
ar: يجب أن تتطابق كلمة المرور الجديدة مع التأكيد.

# User_RefreshTokenRequired
source: Refresh token is required.
ar: رمز التحديث مطلوب.

# Blog_MetaTitleMaxLength
source: Meta title cannot exceed {0} characters.
ar: لا يمكن أن يتجاوز العنوان الوصفي {0} حرفًا.

# Blog_MetaDescriptionMaxLength
source: Meta description cannot exceed {0} characters.
ar: لا يمكن أن تتجاوز الوصف الوصفي {0} حرفًا.

# Blog_MetaKeywordsMaxLength
source: Meta keywords cannot exceed {0} characters.
ar: لا يمكن أن تتجاوز الكلمات المفتاحية {0} حرفًا.

# Blog_CanonicalUrlMaxLength
source: Canonical URL cannot exceed {0} characters.
ar: لا يمكن أن يتجاوز الرابط القانوني {0} حرفًا.

# Blog_CanonicalUrlInvalid
source: Canonical URL format is invalid.
ar: تنسيق الرابط القانوني غير صالح.

# Blog_SlugMaxLength
source: Slug must not exceed {0} characters.
ar: لا يمكن أن يتجاوز السلاق {0} حرفًا.

# Blog_SlugInvalid
source: Slug must be URL-friendly (lowercase letters, numbers, and dashes only).
ar: يجب أن يكون السلاق مناسبًا للرابط (أحرف صغيرة، أرقام، وشرطات فقط).

# Property_MaxImages
source: A maximum of {0} images are allowed.
ar: يُسمح بحد أقصى {0} من الصور.

# Property_ImageMaxSizeMB
source: Each image must be smaller than {0} MB.
ar: يجب ألا يتجاوز حجم كل صورة {0} ميجابايت.

# Property_ImageInvalidType
source: Only image files are allowed (e.g., jpg, jpeg, png, webp).
ar: يُسمح فقط بملفات الصور (مثل: jpg، jpeg، png، webp).
